// task10.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include <stdlib.h>
#include <math.h>
#include <stdio.h>
using namespace std;

int main()
{
	int f, p=0, s;
	float n;
	cout << "Enter new pounds amount: ";
	cin >> n;
	n=floor(n * 100) / 100;
	p = n * 20 * 12;
	s = p / 12;
	p = p % 12;
	f = s / 20;
	s = s % 20;
	cout << "Pounds amount: "<<f;
	cout << "\nSterlings  amount: "<<s;
	cout << "\nPenses amount: "<<p;
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
